)ATTR DEFAULT(%+_)
    % TYPE(TEXT) INTENS(HIGH) COLOR(WHITE) SKIP(ON)
    ¢ TYPE(TEXT) INTENS(HIGH) COLOR(YELLOW)
    + TYPE(TEXT) INTENS(LOW)  COLOR(TURQ) SKIP(ON)
    _ TYPE(INPUT) INTENS(HIGH) CAPS(OFF) JUST(LEFT) COLOR(RED)
    ~ TYPE(INPUT) INTENS(HIGH) CAPS(ON) JUST(LEFT) COLOR(RED)
      HILITE(USCORE)
    Ý area(SCRL) Extend(ON)
    ¨ type(output) intens(low) caps(off) color(white)
    ` type(ps)
)BODY EXPAND(\\)
+-\-\-¢PDS Cheat Sheet for Subcommands+-\-\-
%OPTION ===>_ZCMD                                                              +
+
+Choose one of the following by number (point-and-shoot):
+
    PDS subcommands                       Save changes to Profile%===>~Z+ (Y/N)+
Ýsam --------------------------------------------------------------------------Ý
)Area Sam
 `1_PDSPRE01                                                                ¨z +
 `2_PDSPRE02                                                                ¨z +
 `3_PDSPRE03                                                                ¨z +
 `4_PDSPRE04                                                                ¨z +
 `5_PDSPRE05                                                                ¨z +
 `6_PDSPRE06                                                                ¨z +
 `7_PDSPRE07                                                                ¨z +
 `8_PDSPRE08                                                                ¨z +
 `9_PDSPRE09                                                                ¨z +
`10_PDSPRE10                                                                ¨z +
`11_PDSPRE11                                                                ¨z +
`12_PDSPRE12                                                                ¨z +
`13_PDSPRE13                                                                ¨z +
`14_PDSPRE14                                                                ¨z +
`15_PDSPRE15                                                                ¨z +
`16_PDSPRE16                                                                ¨z +
`17_PDSPRE17                                                                ¨z +
`18_PDSPRE18                                                                ¨z +
`19_PDSPRE19                                                                ¨z +
`20_PDSPRE20                                                                ¨z +
`21_PDSPRE21                                                                ¨z +
`22_PDSPRE22                                                                ¨z +
`23_PDSPRE23                                                                ¨z +
`24_PDSPRE24                                                                ¨z +
`25_PDSPRE25                                                                ¨z +
`26_PDSPRE26                                                                ¨z +
`27_PDSPRE27                                                                ¨z +
`28_PDSPRE28                                                                ¨z +
`29_PDSPRE29                                                                ¨z +
`30_PDSPRE30                                                                ¨z +
`31_PDSPRE31                                                                ¨z +
`32_PDSPRE32                                                                ¨z +
`33_PDSPRE33                                                                ¨z +
`34_PDSPRE34                                                                ¨z +
`35_PDSPRE35                                                                ¨z +
`36_PDSPRE36                                                                ¨z +
`37_PDSPRE37                                                                ¨z +
`38_PDSPRE38                                                                ¨z +
`39_PDSPRE39                                                                ¨z +
`40_PDSPRE40                                                                ¨z +
`41_PDSPRE41                                                                ¨z +
`42_PDSPRE42                                                                ¨z +
`43_PDSPRE43                                                                ¨z +
`44_PDSPRE44                                                                ¨z +
`45_PDSPRE45                                                                ¨z +
`46_PDSPRE46                                                                ¨z +
`47_PDSPRE47                                                                ¨z +
`48_PDSPRE48                                                                ¨z +
`49_PDSPRE49                                                                ¨z +
`50_PDSPRE50                                                                ¨z +
)INIT
  .HELP   = P86CHET0
  IF (&SAVECHGS = ' ')
    &SAVECHGS = 'Y'
  .zvars = '(SAVECHGS PS01 PS02 PS03 PS04 PS05 PS06 PS07 PS08 PS09 +
             PS10 PS11 PS12 PS13 PS14 PS15 PS16 PS17 PS18 PS19 +
             PS20 PS21 PS22 PS23 PS24 PS25 PS26 PS27 PS28 PS29 +
             PS30 PS31 PS32 PS33 PS34 PS35 PS36 PS37 PS38 PS39 +
             PS40 PS41 PS42 PS43 PS44 PS45 PS46 PS47 PS48 PS49 +
             PS50)'
)PROC
  IF (&ZCMD = 1)
    &PDSPRE00 = &PDSPRE01
    VPUT (PDSPRE00) PROFILE
  IF (&ZCMD = 2)
    &PDSPRE00 = &PDSPRE02
    VPUT (PDSPRE00) PROFILE
  IF (&ZCMD = 3)
    &PDSPRE00 = &PDSPRE03
    VPUT (PDSPRE00) PROFILE
  IF (&ZCMD = 4)
    &PDSPRE00 = &PDSPRE04
    VPUT (PDSPRE00) PROFILE
  IF (&ZCMD = 5)
    &PDSPRE00 = &PDSPRE05
    VPUT (PDSPRE00) PROFILE
  IF (&ZCMD = 6)
    &PDSPRE00 = &PDSPRE06
    VPUT (PDSPRE00) PROFILE
  IF (&ZCMD = 7)
    &PDSPRE00 = &PDSPRE07
    VPUT (PDSPRE00) PROFILE
  IF (&ZCMD = 8)
    &PDSPRE00 = &PDSPRE08
    VPUT (PDSPRE00) PROFILE
  IF (&ZCMD = 9)
    &PDSPRE00 = &PDSPRE09
    VPUT (PDSPRE00) PROFILE
  IF (&ZCMD = 10)
    &PDSPRE00 = &PDSPRE10
    VPUT (PDSPRE00) PROFILE
  IF (&ZCMD = 11)
    &PDSPRE00 = &PDSPRE11
    VPUT (PDSPRE00) PROFILE
  IF (&ZCMD = 12)
    &PDSPRE00 = &PDSPRE12
    VPUT (PDSPRE00) PROFILE
  IF (&ZCMD = 13)
    &PDSPRE00 = &PDSPRE13
    VPUT (PDSPRE00) PROFILE
  IF (&ZCMD = 14)
    &PDSPRE00 = &PDSPRE14
    VPUT (PDSPRE00) PROFILE
  IF (&ZCMD = 15)
    &PDSPRE00 = &PDSPRE15
    VPUT (PDSPRE00) PROFILE
  IF (&ZCMD = 16)
    &PDSPRE00 = &PDSPRE16
    VPUT (PDSPRE00) PROFILE
  IF (&ZCMD = 17)
    &PDSPRE00 = &PDSPRE17
    VPUT (PDSPRE00) PROFILE
  IF (&ZCMD = 18)
    &PDSPRE00 = &PDSPRE18
    VPUT (PDSPRE00) PROFILE
  IF (&ZCMD = 19)
    &PDSPRE00 = &PDSPRE19
    VPUT (PDSPRE00) PROFILE
  IF (&ZCMD = 20)
    &PDSPRE00 = &PDSPRE20
    VPUT (PDSPRE00) PROFILE
  IF (&ZCMD = 21)
    &PDSPRE00 = &PDSPRE21
    VPUT (PDSPRE00) PROFILE
  IF (&ZCMD = 22)
    &PDSPRE00 = &PDSPRE22
    VPUT (PDSPRE00) PROFILE
  IF (&ZCMD = 23)
    &PDSPRE00 = &PDSPRE23
    VPUT (PDSPRE00) PROFILE
  IF (&ZCMD = 24)
    &PDSPRE00 = &PDSPRE24
    VPUT (PDSPRE00) PROFILE
  IF (&ZCMD = 25)
    &PDSPRE00 = &PDSPRE25
    VPUT (PDSPRE00) PROFILE
  IF (&ZCMD = 26)
    &PDSPRE00 = &PDSPRE26
    VPUT (PDSPRE00) PROFILE
  IF (&ZCMD = 27)
    &PDSPRE00 = &PDSPRE27
    VPUT (PDSPRE00) PROFILE
  IF (&ZCMD = 28)
    &PDSPRE00 = &PDSPRE28
    VPUT (PDSPRE00) PROFILE
  IF (&ZCMD = 29)
    &PDSPRE00 = &PDSPRE29
    VPUT (PDSPRE00) PROFILE
  IF (&ZCMD = 30)
    &PDSPRE00 = &PDSPRE30
    VPUT (PDSPRE00) PROFILE
  IF (&ZCMD = 31)
    &PDSPRE00 = &PDSPRE31
    VPUT (PDSPRE00) PROFILE
  IF (&ZCMD = 32)
    &PDSPRE00 = &PDSPRE32
    VPUT (PDSPRE00) PROFILE
  IF (&ZCMD = 33)
    &PDSPRE00 = &PDSPRE33
    VPUT (PDSPRE00) PROFILE
  IF (&ZCMD = 34)
    &PDSPRE00 = &PDSPRE34
    VPUT (PDSPRE00) PROFILE
  IF (&ZCMD = 35)
    &PDSPRE00 = &PDSPRE35
    VPUT (PDSPRE00) PROFILE
  IF (&ZCMD = 36)
    &PDSPRE00 = &PDSPRE36
    VPUT (PDSPRE00) PROFILE
  IF (&ZCMD = 37)
    &PDSPRE00 = &PDSPRE37
    VPUT (PDSPRE00) PROFILE
  IF (&ZCMD = 38)
    &PDSPRE00 = &PDSPRE38
    VPUT (PDSPRE00) PROFILE
  IF (&ZCMD = 39)
    &PDSPRE00 = &PDSPRE39
    VPUT (PDSPRE00) PROFILE
  IF (&ZCMD = 40)
    &PDSPRE00 = &PDSPRE40
    VPUT (PDSPRE00) PROFILE
  IF (&ZCMD = 41)
    &PDSPRE00 = &PDSPRE41
    VPUT (PDSPRE00) PROFILE
  IF (&ZCMD = 42)
    &PDSPRE00 = &PDSPRE42
    VPUT (PDSPRE00) PROFILE
  IF (&ZCMD = 43)
    &PDSPRE00 = &PDSPRE43
    VPUT (PDSPRE00) PROFILE
  IF (&ZCMD = 44)
    &PDSPRE00 = &PDSPRE44
    VPUT (PDSPRE00) PROFILE
  IF (&ZCMD = 45)
    &PDSPRE00 = &PDSPRE45
    VPUT (PDSPRE00) PROFILE
  IF (&ZCMD = 46)
    &PDSPRE00 = &PDSPRE46
    VPUT (PDSPRE00) PROFILE
  IF (&ZCMD = 47)
    &PDSPRE00 = &PDSPRE47
    VPUT (PDSPRE00) PROFILE
  IF (&ZCMD = 48)
    &PDSPRE00 = &PDSPRE48
    VPUT (PDSPRE00) PROFILE
  IF (&ZCMD = 49)
    &PDSPRE00 = &PDSPRE49
    VPUT (PDSPRE00) PROFILE
  IF (&ZCMD = 50)
    &PDSPRE00 = &PDSPRE50
    VPUT (PDSPRE00) PROFILE
  IF (&SAVECHGS = 'Y')
    VPUT (PDSPRE01) PROFILE
    VPUT (PDSPRE02) PROFILE
    VPUT (PDSPRE03) PROFILE
    VPUT (PDSPRE04) PROFILE
    VPUT (PDSPRE05) PROFILE
    VPUT (PDSPRE06) PROFILE
    VPUT (PDSPRE07) PROFILE
    VPUT (PDSPRE08) PROFILE
    VPUT (PDSPRE09) PROFILE
    VPUT (PDSPRE10) PROFILE
    VPUT (PDSPRE11) PROFILE
    VPUT (PDSPRE12) PROFILE
    VPUT (PDSPRE13) PROFILE
    VPUT (PDSPRE14) PROFILE
    VPUT (PDSPRE15) PROFILE
    VPUT (PDSPRE16) PROFILE
    VPUT (PDSPRE17) PROFILE
    VPUT (PDSPRE18) PROFILE
    VPUT (PDSPRE19) PROFILE
    VPUT (PDSPRE20) PROFILE
    VPUT (PDSPRE21) PROFILE
    VPUT (PDSPRE22) PROFILE
    VPUT (PDSPRE23) PROFILE
    VPUT (PDSPRE24) PROFILE
    VPUT (PDSPRE25) PROFILE
    VPUT (PDSPRE26) PROFILE
    VPUT (PDSPRE27) PROFILE
    VPUT (PDSPRE28) PROFILE
    VPUT (PDSPRE29) PROFILE
    VPUT (PDSPRE30) PROFILE
    VPUT (PDSPRE31) PROFILE
    VPUT (PDSPRE32) PROFILE
    VPUT (PDSPRE33) PROFILE
    VPUT (PDSPRE34) PROFILE
    VPUT (PDSPRE35) PROFILE
    VPUT (PDSPRE36) PROFILE
    VPUT (PDSPRE37) PROFILE
    VPUT (PDSPRE38) PROFILE
    VPUT (PDSPRE39) PROFILE
    VPUT (PDSPRE40) PROFILE
    VPUT (PDSPRE41) PROFILE
    VPUT (PDSPRE42) PROFILE
    VPUT (PDSPRE43) PROFILE
    VPUT (PDSPRE44) PROFILE
    VPUT (PDSPRE45) PROFILE
    VPUT (PDSPRE46) PROFILE
    VPUT (PDSPRE47) PROFILE
    VPUT (PDSPRE48) PROFILE
    VPUT (PDSPRE49) PROFILE
    VPUT (PDSPRE50) PROFILE
  &pdszsel=TRANS(TRUNC(&ZCMD,'.')
          1,'PANEL(P86CHEAP)'
          2,'PANEL(P86CHEAP)'
          3,'PANEL(P86CHEAP)'
          4,'PANEL(P86CHEAP)'
          5,'PANEL(P86CHEAP)'
          6,'PANEL(P86CHEAP)'
          7,'PANEL(P86CHEAP)'
          8,'PANEL(P86CHEAP)'
          9,'PANEL(P86CHEAP)'
         10,'PANEL(P86CHEAP)'
         11,'PANEL(P86CHEAP)'
         12,'PANEL(P86CHEAP)'
         13,'PANEL(P86CHEAP)'
         14,'PANEL(P86CHEAP)'
         15,'PANEL(P86CHEAP)'
         16,'PANEL(P86CHEAP)'
         17,'PANEL(P86CHEAP)'
         18,'PANEL(P86CHEAP)'
         19,'PANEL(P86CHEAP)'
         20,'PANEL(P86CHEAP)'
         21,'PANEL(P86CHEAP)'
         22,'PANEL(P86CHEAP)'
         23,'PANEL(P86CHEAP)'
         24,'PANEL(P86CHEAP)'
         25,'PANEL(P86CHEAP)'
         26,'PANEL(P86CHEAP)'
         27,'PANEL(P86CHEAP)'
         28,'PANEL(P86CHEAP)'
         29,'PANEL(P86CHEAP)'
         30,'PANEL(P86CHEAP)'
         31,'PANEL(P86CHEAP)'
         32,'PANEL(P86CHEAP)'
         33,'PANEL(P86CHEAP)'
         34,'PANEL(P86CHEAP)'
         35,'PANEL(P86CHEAP)'
         36,'PANEL(P86CHEAP)'
         37,'PANEL(P86CHEAP)'
         38,'PANEL(P86CHEAP)'
         39,'PANEL(P86CHEAP)'
         40,'PANEL(P86CHEAP)'
         41,'PANEL(P86CHEAP)'
         42,'PANEL(P86CHEAP)'
         43,'PANEL(P86CHEAP)'
         44,'PANEL(P86CHEAP)'
         45,'PANEL(P86CHEAP)'
         46,'PANEL(P86CHEAP)'
         47,'PANEL(P86CHEAP)'
         48,'PANEL(P86CHEAP)'
         49,'PANEL(P86CHEAP)'
         50,'PANEL(P86CHEAP)'
          ' ',' '
          *,' ' )
)FIELD
  FIELD(PDSPRE01) IND(PS01,'<>') LEN(244)
  FIELD(PDSPRE02) IND(PS02,'<>') LEN(244)
  FIELD(PDSPRE03) IND(PS03,'<>') LEN(244)
  FIELD(PDSPRE04) IND(PS04,'<>') LEN(244)
  FIELD(PDSPRE05) IND(PS05,'<>') LEN(244)
  FIELD(PDSPRE06) IND(PS06,'<>') LEN(244)
  FIELD(PDSPRE07) IND(PS07,'<>') LEN(244)
  FIELD(PDSPRE08) IND(PS08,'<>') LEN(244)
  FIELD(PDSPRE09) IND(PS09,'<>') LEN(244)
  FIELD(PDSPRE10) IND(PS10,'<>') LEN(244)
  FIELD(PDSPRE11) IND(PS11,'<>') LEN(244)
  FIELD(PDSPRE12) IND(PS12,'<>') LEN(244)
  FIELD(PDSPRE13) IND(PS13,'<>') LEN(244)
  FIELD(PDSPRE14) IND(PS14,'<>') LEN(244)
  FIELD(PDSPRE15) IND(PS15,'<>') LEN(244)
  FIELD(PDSPRE16) IND(PS16,'<>') LEN(244)
  FIELD(PDSPRE17) IND(PS17,'<>') LEN(244)
  FIELD(PDSPRE18) IND(PS18,'<>') LEN(244)
  FIELD(PDSPRE19) IND(PS19,'<>') LEN(244)
  FIELD(PDSPRE20) IND(PS20,'<>') LEN(244)
  FIELD(PDSPRE21) IND(PS21,'<>') LEN(244)
  FIELD(PDSPRE22) IND(PS22,'<>') LEN(244)
  FIELD(PDSPRE23) IND(PS23,'<>') LEN(244)
  FIELD(PDSPRE24) IND(PS24,'<>') LEN(244)
  FIELD(PDSPRE25) IND(PS25,'<>') LEN(244)
  FIELD(PDSPRE26) IND(PS26,'<>') LEN(244)
  FIELD(PDSPRE27) IND(PS27,'<>') LEN(244)
  FIELD(PDSPRE28) IND(PS28,'<>') LEN(244)
  FIELD(PDSPRE29) IND(PS29,'<>') LEN(244)
  FIELD(PDSPRE30) IND(PS30,'<>') LEN(244)
  FIELD(PDSPRE31) IND(PS31,'<>') LEN(244)
  FIELD(PDSPRE32) IND(PS32,'<>') LEN(244)
  FIELD(PDSPRE33) IND(PS33,'<>') LEN(244)
  FIELD(PDSPRE34) IND(PS34,'<>') LEN(244)
  FIELD(PDSPRE35) IND(PS35,'<>') LEN(244)
  FIELD(PDSPRE36) IND(PS36,'<>') LEN(244)
  FIELD(PDSPRE37) IND(PS37,'<>') LEN(244)
  FIELD(PDSPRE38) IND(PS38,'<>') LEN(244)
  FIELD(PDSPRE39) IND(PS39,'<>') LEN(244)
  FIELD(PDSPRE40) IND(PS40,'<>') LEN(244)
  FIELD(PDSPRE41) IND(PS41,'<>') LEN(244)
  FIELD(PDSPRE42) IND(PS42,'<>') LEN(244)
  FIELD(PDSPRE43) IND(PS43,'<>') LEN(244)
  FIELD(PDSPRE44) IND(PS44,'<>') LEN(244)
  FIELD(PDSPRE45) IND(PS45,'<>') LEN(244)
  FIELD(PDSPRE46) IND(PS46,'<>') LEN(244)
  FIELD(PDSPRE47) IND(PS47,'<>') LEN(244)
  FIELD(PDSPRE48) IND(PS48,'<>') LEN(244)
  FIELD(PDSPRE49) IND(PS49,'<>') LEN(244)
  FIELD(PDSPRE50) IND(PS50,'<>') LEN(244)
)PNTS
  FIELD(ZPS01001) VAR(ZCMD) VAL(1)
  FIELD(ZPS01002) VAR(ZCMD) VAL(2)
  FIELD(ZPS01003) VAR(ZCMD) VAL(3)
  FIELD(ZPS01004) VAR(ZCMD) VAL(4)
  FIELD(ZPS01005) VAR(ZCMD) VAL(5)
  FIELD(ZPS01006) VAR(ZCMD) VAL(6)
  FIELD(ZPS01007) VAR(ZCMD) VAL(7)
  FIELD(ZPS01008) VAR(ZCMD) VAL(8)
  FIELD(ZPS01009) VAR(ZCMD) VAL(9)
  FIELD(ZPS01010) VAR(ZCMD) VAL(10)
  FIELD(ZPS01011) VAR(ZCMD) VAL(11)
  FIELD(ZPS01012) VAR(ZCMD) VAL(12)
  FIELD(ZPS01013) VAR(ZCMD) VAL(13)
  FIELD(ZPS01014) VAR(ZCMD) VAL(14)
  FIELD(ZPS01015) VAR(ZCMD) VAL(15)
  FIELD(ZPS01016) VAR(ZCMD) VAL(16)
  FIELD(ZPS01017) VAR(ZCMD) VAL(17)
  FIELD(ZPS01018) VAR(ZCMD) VAL(18)
  FIELD(ZPS01019) VAR(ZCMD) VAL(19)
  FIELD(ZPS01020) VAR(ZCMD) VAL(20)
  FIELD(ZPS01021) VAR(ZCMD) VAL(21)
  FIELD(ZPS01022) VAR(ZCMD) VAL(22)
  FIELD(ZPS01023) VAR(ZCMD) VAL(23)
  FIELD(ZPS01024) VAR(ZCMD) VAL(24)
  FIELD(ZPS01025) VAR(ZCMD) VAL(25)
  FIELD(ZPS01026) VAR(ZCMD) VAL(26)
  FIELD(ZPS01027) VAR(ZCMD) VAL(27)
  FIELD(ZPS01028) VAR(ZCMD) VAL(28)
  FIELD(ZPS01029) VAR(ZCMD) VAL(29)
  FIELD(ZPS01030) VAR(ZCMD) VAL(30)
  FIELD(ZPS01031) VAR(ZCMD) VAL(31)
  FIELD(ZPS01032) VAR(ZCMD) VAL(32)
  FIELD(ZPS01033) VAR(ZCMD) VAL(33)
  FIELD(ZPS01034) VAR(ZCMD) VAL(34)
  FIELD(ZPS01035) VAR(ZCMD) VAL(35)
  FIELD(ZPS01036) VAR(ZCMD) VAL(36)
  FIELD(ZPS01037) VAR(ZCMD) VAL(37)
  FIELD(ZPS01038) VAR(ZCMD) VAL(38)
  FIELD(ZPS01039) VAR(ZCMD) VAL(39)
  FIELD(ZPS01040) VAR(ZCMD) VAL(40)
  FIELD(ZPS01041) VAR(ZCMD) VAL(41)
  FIELD(ZPS01042) VAR(ZCMD) VAL(42)
  FIELD(ZPS01043) VAR(ZCMD) VAL(43)
  FIELD(ZPS01044) VAR(ZCMD) VAL(44)
  FIELD(ZPS01045) VAR(ZCMD) VAL(45)
  FIELD(ZPS01046) VAR(ZCMD) VAL(46)
  FIELD(ZPS01047) VAR(ZCMD) VAL(47)
  FIELD(ZPS01048) VAR(ZCMD) VAL(48)
  FIELD(ZPS01049) VAR(ZCMD) VAL(49)
  FIELD(ZPS01050) VAR(ZCMD) VAL(50)
)END
