)ATTR DEFAULT(%+_)
    % TYPE(TEXT) INTENS(HIGH) COLOR(WHITE) SKIP(ON)
    ¢ TYPE(TEXT) INTENS(HIGH) COLOR(YELLOW)
    ? TYPE(TEXT) INTENS(HIGH) COLOR(RED)
    ! TYPE(TEXT) INTENS(HIGH) COLOR(BLUE)
    + TYPE(TEXT) INTENS(LOW)  COLOR(TURQ) SKIP(ON)
    _ TYPE(INPUT) INTENS(HIGH) CAPS(ON) JUST(LEFT) COLOR(RED)
    ¬ TYPE(INPUT) INTENS(HIGH) CAPS(ON) JUST(LEFT) COLOR(RED) PAD(_)
    ¦ TYPE(INPUT) INTENS(HIGH) CAPS(OFF)
)BODY EXPAND(\\)
+-\-\-¢PDS user line command+-\-\-
%OPTION  ===>_ZCMD                                                             +
+
 Choose one of the following:

   %ALC +- Allocate dataset prompt
   %CMP +- COMPARE current dataset
   %CHGS+- MATCH current dataset
   %DSAT+- DSAT command
   %INFO+- Display dataset information
   %LC  +- LISTCAT command
   %LIKE+- Allocate dataset like
   %PGL +- PGLITE member generations dialog
   %RAC +- RACF LISTDSD command
   %REV +- REVIEW command
   %RMMI+- RMM tape inquiry
   %TI  +- CA-1 tape inquiry
   %VS  +- VSAM information
   %XMIT+- XMIT command
   %WG  +- WHOSGOT command

 Note: this is a installation-modifiable panel; the commands on this
 panel may also be used as line commands from the LISTC panel.
)INIT
 .HELP = P86PNK@
 &LCDSN = '''&PDSCDSN'''
)PROC
 &PDSZSEL=TRANS(TRUNC(&ZCMD,'.')
           ALC,'PANEL(P86ALCLF)'
          DSAT,'TRP(DSAT ''&PDSCDSN'' VOLUME(&PDSCVOL))'
          CHGS,'MATCH ''&PDSCDSN'' CHANGED SUBLIST VOLUME(&PDSCVOL)'
           CMP,'COMPARE ''&PDSDSN'' ''&PDSCDSN'' NVOL(&PDSCVOL)'
          INFO,'CMD(%PDSINFO ''&PDSCDSN'')'
             I,'CMD(%PDSINFO ''&PDSCDSN'')'
            LC,'TRP(LISTCAT ENTRIES(''&PDSCDSN'') ALL)'
          LIKE,'CMD(%PDSMODEL ''&PDSCDSN'' &PDSCVOL)'
           RAC,'PANEL(P86LCRAC)'
           REV,'CMD(REV ''&PDSCDSN'' VOLUME(&PDSCVOL))'
            TI,'CMD(%PDSTI &PDSCDSN &PDSCVOL)'
            VS,'CMD(%VI &PDSCDSN)'
          RMMI,'CMD(%EDGRPD34 S &PDSCDSN &PDSCVOL)'
          TLMS,'CMD(%CATLISPF S &PDSCDSN &PDSCVOL)'
           PGL,'CMD(%PGLITE ''&PDSCDSN'')'
            WG,'TRP(WHOSGOT ''&PDSCDSN'')'
          XMIT,'PANEL(P86XMILF)'
           ' ',' '
             *,'?')
 &ZTRAIL=.TRAIL
 &OPERS =.TRAIL
)END
 Note: this panel is normally reached by entering o as a line command
 from a LISTC panel, followed by entering ut from the command selection
 panel.  The commands above may also be used as direct line commands
 from the LISTC panel; thus, this is termed an "extensible panel".

 If you modify this panel, documentation is found in PDS source
       member $$$CUSTM
