)ATTR DEFAULT(%+_)
    % TYPE(TEXT) INTENS(HIGH) COLOR(WHITE) SKIP(ON)
    ¢ TYPE(TEXT) INTENS(HIGH) COLOR(YELLOW)
    + TYPE(TEXT) INTENS(LOW)  COLOR(TURQ) SKIP(ON)
    _ TYPE(INPUT) INTENS(HIGH) CAPS(ON) JUST(LEFT) COLOR(RED)
    ¬ TYPE(INPUT) INTENS(HIGH) CAPS(ON) JUST(LEFT) COLOR(RED) PAD(_)
    ¦ TYPE(INPUT) INTENS(HIGH) CAPS(OFF)
)BODY EXPAND(\\)
+-\-\-¢PTSEXP line command+-\-\-
%OPTION  ===>¦ZCMD                                                             +
%
+Enter any operands below for%PTSEXP  &PDSMEM
%===>¦LOPER
                                                                               +
+Operands:% output.dataset      -+identifies the output data set
%                                +that GIMCPTS will write to
%           LIST/NOLIST         -+listing detail control
%           EXPAND/COMPACT      -+SYSMOD data is to be expanded/compacted
%           OLD/SHR/MOD/NEW     -+output dataset disposition
%                                +if NEW, TRK/CYL, SPACE(prim,sec),
%                                +VOLUME(volser)
%
%                                +MOD/APPEND:  members are to be added to the
%                                +end of the output dataset
%
+Note:      The PTSEXP subcommand expands/compacts SYSMOD data from a source
+           member using the IBM SYSMOD compaction service routine.
+
+Required:  output.dataset
+Defaults:  SHR, LIST, EXPAND
)INIT
  &LOPER  = '&OPERS'
  .CURSOR = LOPER
  .HELP   = P86OPHH
  IF(&LOPER  = &Z) &LOPER=&P86#PT1
)PROC
 &P86#PT1=&LOPER
 &PDSZSEL='PTsexp &PDSMEM &LOPER'
)END
