)ATTR DEFAULT(%+_)
    % TYPE(TEXT) INTENS(HIGH) COLOR(WHITE) SKIP(ON)
    ? TYPE(TEXT) INTENS(HIGH) COLOR(RED)
    ¢ TYPE(TEXT) INTENS(HIGH) COLOR(YELLOW)
    + TYPE(TEXT) INTENS(LOW)  COLOR(TURQ) SKIP(ON)
    _ TYPE(INPUT) INTENS(HIGH) CAPS(ON) JUST(LEFT) COLOR(RED)
    ¬ TYPE(INPUT) INTENS(HIGH) CAPS(ON) JUST(LEFT) COLOR(RED) PAD(_)
    ¦ TYPE(INPUT) INTENS(HIGH) CAPS(OFF)
)BODY EXPAND(\\)
+-\-\-¢PDS user line command+-\-\-
%OPTION  ===>_ZCMD                                                             +
+

 Choose one of the following:

    %DSAT+- DSAT for data set '&PDSADSN'
    %DVOL+- DVOL command for volume?&PDSAVOL+
    %INFO+- Display dataset information
    %LC  +- IDCAMS LISTC for data set '&PDSADSN'
    %LIKE+- Allocate a new data set based on '&PDSADSN'
    %REV +- REVIEW for data set '&PDSADSN'
    %WG  +- WHOSGOT command for data set '&PDSADSN'
+


 Note: this is a installation-modifiable panel; the commands on this
 panel may also be used as line commands from the LISTA panel.
)INIT
 .HELP = P86PNF@
)PROC
 &PDSZSEL=TRANS(TRUNC(&ZCMD,'.')
          DSAT,'CMD(DSAT ''&PDSADSN'')'
          DVOL,'CMD(DVOL &PDSAVOL LONG)'
          INFO,'CMD(%PDSINFO ''&PDSADSN'')'
             I,'CMD(%PDSINFO ''&PDSADSN'')'
            LC,'TRP(LISTC ENT(''&PDSADSN'') ALL)'
          LIKE,'CMD(%PDSMODEL ''&PDSADSN'' &PDSAVOL)'
           REV,'CMD(REV ''&PDSADSN'')'
            WG,'TRP(WHOSGOT ''&PDSADSN'')'
           ' ',' '
             *,'?')
 &ZTRAIL=.TRAIL
 &OPERS =.TRAIL
)END
 Note: this panel is normally reached by entering o as a line command
 from a LISTA panel, followed by entering ut from the command selection
 panel.  The commands above may also be used as direct line commands
 from the LISTA panel; thus, this is termed an "extensible panel".

 If you modify this panel, documentation is found in PDS source
       member $$$CUSTM
