)ATTR DEFAULT(%+_)
    % TYPE(TEXT) INTENS(HIGH) COLOR(WHITE) SKIP(ON)
    ¢ TYPE(TEXT) INTENS(HIGH) COLOR(YELLOW)
    ~ TYPE(TEXT) INTENS(HIGH) COLOR(BLUE)
    + TYPE(TEXT) INTENS(LOW)  COLOR(TURQ) SKIP(ON)
    _ TYPE(INPUT) INTENS(HIGH) CAPS(ON) JUST(LEFT) COLOR(RED)
    ¬ TYPE(INPUT) INTENS(HIGH) CAPS(ON) JUST(LEFT) COLOR(RED) PAD(_)
    ¦ TYPE(INPUT) INTENS(HIGH) CAPS(OFF)
)BODY EXPAND(\\)
+-\-\-¢PDS LISTC/LISTFILE Command Selection+-\-\-
%OPTION  ===>_ZCMD                                                             +
+
+
+Enter operands for LISTC/LISTFILE
%===>_LOPER                                                            +
+
+Optional:
%   DSAT           +- Use DSAT command to build or add to table.
%   VTOC           +- Use VTOC command to build or add to table.
%   V2             +- Use VTOC command to build or add to table with
                     ~optional prompt for LIMIT/ANDn/ORn values.
%   RESET          +- Clear table before building a new table.


+Note: Pressing Enter with no operands will select the%DSAT+option.
)INIT
  &LOPER  = '&OPERS'
  .CURSOR = LOPER
 .HELP = P86PNK@
  IF(&LOPER  = &Z) &LOPER=&P86#LT3
  IF(&ZCMD ¬= &Z)
    &X=TRUNC(&ZCMD,' ')
    &LOPER = .TRAIL
    &ZCMD = &Z
)PROC
 &P86#LT3=&LOPER
 IF (&LOPER =&Z) &LOPER=DSAT
 &PDSZSEL = 'LISTC  &LOPER'
)END
