)ATTR DEFAULT(%+_)
    % TYPE(TEXT) INTENS(HIGH) COLOR(WHITE) SKIP(ON)
    ¢ TYPE(TEXT) INTENS(HIGH) COLOR(YELLOW)
    + TYPE(TEXT) INTENS(LOW)  COLOR(TURQ) SKIP(ON)
    _ TYPE(INPUT) INTENS(HIGH) CAPS(ON) JUST(LEFT) COLOR(RED)
    ¬ TYPE(INPUT) INTENS(HIGH) CAPS(ON) JUST(LEFT) COLOR(RED) PAD(_)
    ¦ TYPE(INPUT) INTENS(HIGH) CAPS(OFF)
    < AREA(SCRL) EXTEND(ON)
)BODY EXPAND(\\)
+-\-\-¢CSC Utility Selection Panel+-\-\-
%OPTION  ===>_ZCMD


                  +
+  Make a selection:
<PDSAREA                                                                       <
)AREA PDSAREA
      %ALC   + Allocate dataset prompt
      %CBT   + The Official CBT ISPF Application
      %CHEAT + PDS cheat sheet for long subcommands
      %CHGM  + CHANGE dataset menu
      %CHGS  + Summary of changes for PDS command processor
      %COPMSG+ Extract XMIT/IEBCOPY summary messages from SYSOUT
      %CREATE+ ISPF Data Set Utility (Option 3.2)
      %DT+     Michael Theys Date Calendar
      %EDITLOG+Edit ISPMODE Log with ISPF
      %EDSL+   Lionel Dyck Enhanced Data Set List
      %FAMS+   Dan Dalby FAMS attribute extract
      %FLIP+   Switch between current and previous data sets
      %FP+     FInd ISPF packed members
      %GLOBAL+ Run subcommand for each file in LISTC table
      %GO+     CHANGE to ddname concat#
      %GROUP + Member group prompt
      %IDCAMS+ Run IDCAMS command
      %INFO  + Display dataset information
      %IRL   + Last 30 Referenced DSNAMEs
      %LMOD+   Locate executable module in LPA, LINKLIB, LNKLST, or STEPLIB
      %MBRGEN+ Lionel Dyck PDSE V2 member generations dialog
      %MODEL + Allocate a new data set based on the active data set
      %PGLITE+ A simpler version, or subset, of PDSEGEN
      %ADM   + RACF security administration
      %NEW   + Most recent modifications to the PDS command processor
      %PACK  + Pack dataset with TRSMAIN
      %PDSC  + Execute PDS Subcommands
      %PRDS  + Bill Smith PRINTDS dialog
      %YALE  + Compare two PDS files with Yale COMPARE command
      %QR    + PDS Quick Reference
      %REL   + RELEXTENT option of FIXPDS
      %STATUS+ PDS Function Status
      %TOUCH + ADDSTATS to a member
      %TRANS + IBM product codes for compilers
      %UNPACK+ Unpack dataset with TRSMAIN
      %VB2FB + Lionel Dyck Copy Variable->Fixed and Fixed->Variable
      %VERS  + Display PDS version number in Starboard area
      %WB    + PDSE Work Bench (member generations)
      %XMIT  + XMIT dataset prompt
      %ZAP   + ZAP command processor
      %ZM    + MEMLIST of load modules zapped in last 30 days
      %ZQ    + MEMLIST of load modules zapped in last 90 days
      %-DUP  + Allocate a .NEW dataset like the current dataset
      %-PDSE + PDSE support notes
      %-STOW + STOW error return codes

 Note: this is a installation-modifiable panel; the commands on this
 panel may also be used as primary commands from ISPMODE or MEMLIST.
)INIT
  .HELP = P86OPPUX
  *Rexx(ZMONTH,ZYEAR,MMONTH,MYEAR,QMONTH,QYEAR)
    If zmonth > 1 Then
      mmonth = zmonth - 1
    Else
      mmonth = zmonth + 11
    If zmonth > 3 Then
      qmonth = zmonth - 3
    Else
      qmonth = zmonth + 9
    myear = zyear
    If mmonth = 12 Then
      myear = zyear - 1
    qyear = zyear
    If qmonth >  9 Then
      qyear = qyear - 1
  *EndRexx
)PROC
 &PDSVOLK = &Z
 &PDSUNIT = &Z
 IF (&PDSVOL ¬= &Z)
    &PDSVOLK= 'VOL(&PDSVOL)'
    &PDSUNIT= 'UNIT(SYSALLDA)'
 &NEWZCMD=TRUNC(&ZCMD,' ')
 &OPERAND=.TRAIL

 *Rexx(OPERAND,OPERND1,OPERND2)
 parse var operand opernd1 opernd2
 if opernd1 = '' then
   opernd1 = 'SYSPROC'
 opernd2 = strip(opernd2)
 if opernd2 = '' then
   opernd2 = 1
 *EndRexx

 &FROMM = '&MMONTH/&ZDAY/&MYEAR'
 &FROMQ = '&QMONTH/&ZDAY/&QYEAR'
 &TO    = '&ZMONTH/&ZDAY/&ZYEAR'

 &PDSZSEL=TRANS(TRUNC(&NEWZCMD,'.')
          $VER,'CONTROL'
         $VERS,'CONTROL'
        $VERSI,'CONTROL'
      $VERSION,'CONTROL'
          -DUP,'CMD(ALLOC DA(''&PDSDSN..NEW'') LIKE(''&PDSDSN'') +
                    VOL(&PDSVOLAL))'
         -PDSE,'HEL MSG MSG(PDS531W)'
         -STOW,'HEL MSG MSG(PDS856E)'
           ALL,'MEMLIST :'
          MINE,'MEMLIST : ID(&ZUSER)'
           YES,'MEMLIST : YESTERDAY'
           CUR,'MEMLIST : CURRENT'
          CURR,'MEMLIST : CURRENT'
       CURRENT,'MEMLIST : CURRENT'
          YEST,'MEMLIST : YESTERDAY'
        YESTER,'MEMLIST : YESTERDAY'
     YESTERDAY,'MEMLIST : YESTERDAY'
            BI,'MEMLIST : BIWEEK'
        BIWEEK,'MEMLIST : BIWEEK'
           BIM,'MEMLIST : BIMONTH'
          BIMO,'MEMLIST : BIMONTH'
       BIMONTH,'MEMLIST : BIMONTH'
            FO,'MEMLIST : FORTNIGHT'
           FOR,'MEMLIST : FORTNIGHT'
          FORT,'MEMLIST : FORTNIGHT'
            MO,'MEMLIST : MONTH'
            MM,'MEMLIST : MONTH'
           MON,'MEMLIST : MONTH'
           QTR,'MEMLIST : QUARTER'
       QUARTER,'MEMLIST : QUARTER'
         THIRD,'MEMLIST : LAST(120)'
            YR,'MEMLIST : YEAR'
           ALC,'PANEL(P86ALC&PDSDSORG)'
        CONPDS,'CONTROL PDS'
         CONPD,'CONTROL PDS'
          CONP,'CONTROL PDS'
       CONMODS,'CONTROL MODS'
        CONMOD,'CONTROL MODS'
         CONMO,'CONTROL MODS'
          CONM,'CONTROL MODS'
        CONMVS,'CONTROL MVS'
        CONGEO,'CONTROL GEO'
        CREATE,'PGM(ISRUDA) PARM(ISRUDA2) SCRNAME(DSUTIL)'
           MSG,'TRP(Help pdsmsgs &OPERAND)'
          PDSM,'HEL MSG MSG(&OPERAND)'
        PDSMSG,'HEL MSG MSG(&OPERAND)'
            QR,'PGM(ISPTUTOR) PARM(P86QREF)'
           ALC,'PANEL(P86ALC&PDSDSORG)'
         CHEAT,'PANEL(P86CHEAT)'
           CHE,'PANEL(P86CHEAT)'
          CHGM,'PANEL(P86CHG@)'
       CHGMENU,'PANEL(P86CHG@)'
           CUP,'PGM(ISPTUTOR) PARM(P86BLUES)'
        COPMSG,'TRP(%ISFBROW)'
          EDSL,'CMD(%EDSL &OPERAND)'
          FAMS,'TRP(%FAMSATTR &PDSDSN)'
           '>','CHANGE &PDS2DSN'
          FLIP,'CHANGE *'
           FLI,'CHANGE *'
            FL,'CHANGE *'
            FP,'PANEL(P86PFIND)'
           FSH,'PANEL(P86FSHEL)'
          LMOD,'TRP(LMOD &OPERAND)'
        GLOBAL,'CMD(%GLOBAL &OPERAND)'
            GO,'CHANGE FILE(&OPERND1) NUMBER(&OPERND2)'
         GROUP,'PANEL(P86OPGR)'
        IDCAMS,'CMD(%PDSAMS &OPERAND)'
          LIKE,'CMD(%PDSMODEL ''&PDSDSN'' &PDSVOL)'
         MODEL,'CMD(%PDSMODEL ''&PDSDSN'' &PDSVOL)'
       PDSCMDS,'CMD(%PDSCMDS ''&PDSDSN'')'
          PDSC,'CMD(%PDSCMDS ''&PDSDSN'')'
           PCS,'CMD(%PDSCMDS ''&PDSDSN'')'
        PGLITE,'CMD(%PGLITE ''&PDSDSN'')'
           PGL,'CMD(%PGLITE ''&PDSDSN'')'
          INFO,'CMD(%PDSINFO ''&PDSDSN'')'
           ADM,'CMD(EXEC ''AD.RACFADM.EXEC($STUB)'')'
           CBT,'CMD(EXEC ''&ZUSER..CBT.FILEIDX.PDS(CBTVIEW)'')'
           IRL,'PGM(ISRDSLST) PARM(PL1 REFLIST)'
           NEW,'MODS'
       UPDATES,'MODS'
          PACK,'CMD(%PACKDS)'
        UNPACK,'CMD(%UNPACKDS)'
         VB2FB,'CMD(%VB2FB)'
            VB,'CMD(%VB2FB)'
          VERS,'CMD(%PDSVERS)'
          PRDS,'CMD(%PRINTDS ''&PDSDSN'')'
          YALE,'CMD(%YALE)'
        MBRGEN,'CMD(%PDSEGENX ''&PDSDSN'' &OPERAND)'
       RCQDATE,'CMD(%RCQDATEC)'
        RCQDAT,'CMD(%RCQDATEC)'
         RCQDA,'CMD(%RCQDATEC)'
         RCQDT,'CMD(%RCQDATEC)'
          RCQD,'CMD(%RCQDATEC)'
           RCQ,'CMD(%RCQDATEC)'
        MTDATE,'CMD(%RCQDATEC)'
            DT,'CMD(%RCQDATEC)'
       EDITLOG,'CMD(%EDITLOG &OPERAND)'
            EL,'CMD(%EDITLOG &OPERAND)'
            MT,'CMD(%RCQDATEC)'
           REL,'FIXPDS RELEXTENT'
          STAT,'FUNCTION'
        STATUS,'FUNCTION'
         TOUCH,'CMD(%PDSTOUCH ''&PDSDSN'' &OPERAND)'
         TRANS,'CONTROL COMPILER'
          XALL,'X ALL'
            XA,'X ALL'
          XMIT,'PANEL(P86XMIUT)'
             Z,'CMD(ZAP$ ''&PDSDSN'' &PDSVOLK)'
            ZA,'CMD(ZAP$ ''&PDSDSN'' &PDSVOLK)'
           ZAP,'CMD(ZAP$ ''&PDSDSN'' &PDSVOLK)'
        ZMONTH,'IF : CHANGED(&FROMM:&TO) THEN(MEMLIST)'
            ZM,'IF : CHANGED(&FROMM:&TO) THEN(MEMLIST)'
          ZMON,'IF : CHANGED(&FROMM:&TO) THEN(MEMLIST)'
        ZQUART,'IF : CHANGED(&FROMQ:&TO) THEN(MEMLIST)'
          ZQUA,'IF : CHANGED(&FROMQ:&TO) THEN(MEMLIST)'
            ZQ,'IF : CHANGED(&FROMQ:&TO) THEN(MEMLIST)'
             *,' ')
 IF (&PDSZSEL=' ')  /* allow for > 126 pairs */
     &PDSZSEL=TRANS(TRUNC(&NEWZCMD,'.')
            WB,'CMD(FMNMAIN PWB ''&PDSDSN'') MODE(FSCR)'
         LISTD,'TRP(LISTD ''&PDSDSN'')'
           TUT,'PGM(ISPTUTOR) PARM(P86CHGS)'
          CHGS,'PGM(ISPTUTOR) PARM(P86CHGS)'
           APF,'CMD(%LISTFISF APF)'
           LPA,'CMD(%LISTFISF LPA)'
           LNK,'CMD(%LISTFISF LNK)'
          PARM,'CMD(%LISTFISF PARM)'
           ' ',' '
             *,'?')
 &ZTRAIL=.TRAIL
 &OPERS =.TRAIL
)END
 Note: this panel is normally reached by entering O as a primary
 command from an ISPMODE or MEMLIST panel, followed by UT from the
 command selection panel.  The commands above may also be used as
 primary commands from an ISPMODE or MEMLIST panel; thus, this is
 termed an "extensible panel".

 Computer Sciences Corporation (CSC) version of this panel.   DRK APR16

 If you modify this panel, documentation is found in PDS source
       member $$$CUSTM
