)ATTR DEFAULT(%+_)
    % TYPE(TEXT) INTENS(HIGH) COLOR(WHITE) SKIP(ON)
    ¢ TYPE(TEXT) INTENS(HIGH) COLOR(YELLOW)
    + TYPE(TEXT) INTENS(LOW)  COLOR(TURQ) SKIP(ON)
    ~ TYPE(TEXT) INTENS(HIGH) COLOR(RED)
    _ TYPE(INPUT) INTENS(HIGH) CAPS(ON) JUST(LEFT) COLOR(RED)
    ¬ TYPE(INPUT) INTENS(HIGH) CAPS(ON) JUST(LEFT) COLOR(RED) PAD(_)
    ¦ TYPE(INPUT) INTENS(HIGH) CAPS(OFF)
    < AREA(SCRL) EXTEND(ON)
)BODY EXPAND(\\)
%TUTORIAL  +-\-\-¢PDS LISTA Outputs+-\-\-
%OPTION  ===>_ZCMD                                                             +
<PDSAREA                                                                       <
)AREA PDSAREA
  +The first LISTA panel shows basic allocation information such as
   DDNAME, data set TYPE, Open count (under the header OP), VOLUME
   allocated, I/O's (EXCP counts) and DSNAME.  Command error messages
   are provided under the DATA header as follows:
    ~*NOT CON+- File is not concatenated
    ~*NO DDN*+- File has a blank ddname
    ~*DD GONE+- File is not allocated
    ~*OPEN DD+- File is open
    ~*INVALID+- This line command is not supported
    ~*NOTPSPO+- File is not sequential or partitioned
    ~*PERMCON+- File is permanently concatenated
    ~*VTOCERR+- OBTAIN I/O error, rc=12
    ~*NOTONVO+- F1 DSCB not found in VTOC
    ~*BAD DSN+- File is DUMMY or NULLFILE
    ~*IN USE*+- File is in-use

   TYPE will be the data set DSORG or "VIO", "CTLG", "VVDS", "JES" or "TERM".




   The second LISTA panel is a double line panel which includes some
   additional information.  DISP (data set disposition), STAT (data
   set status), BLKSI (block size), LRECL (logical record length),
   RECFM (record format), and CREATED (creation date or member name),
   are also provided on this panel.

   STAT fields: TMP (temporary), PRM (permanent) or CNV (convertible).
)END
